/*
 *
 *-----------------------------------------------------------------------------
 * @Name：    op.c
 * @Desc:     
 * @Author:   liangz.org@gmail.com
 * @Create:   2021.04.02   23:27
 *-----------------------------------------------------------------------------
 * @Change:   2021.04.02
 *-----------------------------------------------------------------------------
*/

#include <stdio.h>
#include <stdlib.h>

/*
 运算符在前，先进行计算， 在取变量值使用
 变量在前，先取变量值使用，在进行计算

 i++; --> 表达式值为1，i值为2
 ++i; --> 表达式值为2，i值为2



*/

int main()
{
    int i = 1, j = 10, value;
//    value = i++ + ++j;
    value = --i + j++;
    printf("i = %d\n", i);
    printf("j = %d\n", j);
    printf("value = %d\n", value);
    exit(0);
}